espressif/esp-idf/components/soc/esp32c61/register/soc/soc_etm_struct.h
/**
 * SPDX-FileCopyrightText: 2024-2025 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: Status register */
/** Type of ch_ena_ad0 register
 *  Channel enable status register
 */
typedef union {
    struct {
        /** ch_enabled0 : R/WTC/WS; bitpos: [0]; default: 0;
         *  Represents channel0 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled0:1;
        /** ch_enabled1 : R/WTC/WS; bitpos: [1]; default: 0;
         *  Represents channel1 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled1:1;
        /** ch_enabled2 : R/WTC/WS; bitpos: [2]; default: 0;
         *  Represents channel2 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled2:1;
        /** ch_enabled3 : R/WTC/WS; bitpos: [3]; default: 0;
         *  Represents channel3 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled3:1;
        /** ch_enabled4 : R/WTC/WS; bitpos: [4]; default: 0;
         *  Represents channel4 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled4:1;
        /** ch_enabled5 : R/WTC/WS; bitpos: [5]; default: 0;
         *  Represents channel5 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled5:1;
        /** ch_enabled6 : R/WTC/WS; bitpos: [6]; default: 0;
         *  Represents channel6 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled6:1;
        /** ch_enabled7 : R/WTC/WS; bitpos: [7]; default: 0;
         *  Represents channel7 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled7:1;
        /** ch_enabled8 : R/WTC/WS; bitpos: [8]; default: 0;
         *  Represents channel8 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled8:1;
        /** ch_enabled9 : R/WTC/WS; bitpos: [9]; default: 0;
         *  Represents channel9 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled9:1;
        /** ch_enabled10 : R/WTC/WS; bitpos: [10]; default: 0;
         *  Represents channel10 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled10:1;
        /** ch_enabled11 : R/WTC/WS; bitpos: [11]; default: 0;
         *  Represents channel11 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled11:1;
        /** ch_enabled12 : R/WTC/WS; bitpos: [12]; default: 0;
         *  Represents channel12 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled12:1;
        /** ch_enabled13 : R/WTC/WS; bitpos: [13]; default: 0;
         *  Represents channel13 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled13:1;
        /** ch_enabled14 : R/WTC/WS; bitpos: [14]; default: 0;
         *  Represents channel14 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled14:1;
        /** ch_enabled15 : R/WTC/WS; bitpos: [15]; default: 0;
         *  Represents channel15 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled15:1;
        /** ch_enabled16 : R/WTC/WS; bitpos: [16]; default: 0;
         *  Represents channel16 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled16:1;
        /** ch_enabled17 : R/WTC/WS; bitpos: [17]; default: 0;
         *  Represents channel17 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled17:1;
        /** ch_enabled18 : R/WTC/WS; bitpos: [18]; default: 0;
         *  Represents channel18 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled18:1;
        /** ch_enabled19 : R/WTC/WS; bitpos: [19]; default: 0;
         *  Represents channel19 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled19:1;
        /** ch_enabled20 : R/WTC/WS; bitpos: [20]; default: 0;
         *  Represents channel20 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled20:1;
        /** ch_enabled21 : R/WTC/WS; bitpos: [21]; default: 0;
         *  Represents channel21 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled21:1;
        /** ch_enabled22 : R/WTC/WS; bitpos: [22]; default: 0;
         *  Represents channel22 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled22:1;
        /** ch_enabled23 : R/WTC/WS; bitpos: [23]; default: 0;
         *  Represents channel23 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled23:1;
        /** ch_enabled24 : R/WTC/WS; bitpos: [24]; default: 0;
         *  Represents channel24 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled24:1;
        /** ch_enabled25 : R/WTC/WS; bitpos: [25]; default: 0;
         *  Represents channel25 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled25:1;
        /** ch_enabled26 : R/WTC/WS; bitpos: [26]; default: 0;
         *  Represents channel26 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled26:1;
        /** ch_enabled27 : R/WTC/WS; bitpos: [27]; default: 0;
         *  Represents channel27 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled27:1;
        /** ch_enabled28 : R/WTC/WS; bitpos: [28]; default: 0;
         *  Represents channel28 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled28:1;
        /** ch_enabled29 : R/WTC/WS; bitpos: [29]; default: 0;
         *  Represents channel29 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled29:1;
        /** ch_enabled30 : R/WTC/WS; bitpos: [30]; default: 0;
         *  Represents channel30 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled30:1;
        /** ch_enabled31 : R/WTC/WS; bitpos: [31]; default: 0;
         *  Represents channel31 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled31:1;
    };
    uint32_t val;
} soc_etm_ch_ena_ad0_reg_t;

/** Type of ch_ena_ad1 register
 *  Channel enable status register
 */
typedef union {
    struct {
        /** ch_enabled32 : R/WTC/WS; bitpos: [0]; default: 0;
         *  Represents channel32 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled32:1;
        /** ch_enabled33 : R/WTC/WS; bitpos: [1]; default: 0;
         *  Represents channel33 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled33:1;
        /** ch_enabled34 : R/WTC/WS; bitpos: [2]; default: 0;
         *  Represents channel34 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled34:1;
        /** ch_enabled35 : R/WTC/WS; bitpos: [3]; default: 0;
         *  Represents channel35 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled35:1;
        /** ch_enabled36 : R/WTC/WS; bitpos: [4]; default: 0;
         *  Represents channel36 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled36:1;
        /** ch_enabled37 : R/WTC/WS; bitpos: [5]; default: 0;
         *  Represents channel37 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled37:1;
        /** ch_enabled38 : R/WTC/WS; bitpos: [6]; default: 0;
         *  Represents channel38 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled38:1;
        /** ch_enabled39 : R/WTC/WS; bitpos: [7]; default: 0;
         *  Represents channel39 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled39:1;
        /** ch_enabled40 : R/WTC/WS; bitpos: [8]; default: 0;
         *  Represents channel40 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled40:1;
        /** ch_enabled41 : R/WTC/WS; bitpos: [9]; default: 0;
         *  Represents channel41 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled41:1;
        /** ch_enabled42 : R/WTC/WS; bitpos: [10]; default: 0;
         *  Represents channel42 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled42:1;
        /** ch_enabled43 : R/WTC/WS; bitpos: [11]; default: 0;
         *  Represents channel43 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled43:1;
        /** ch_enabled44 : R/WTC/WS; bitpos: [12]; default: 0;
         *  Represents channel44 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled44:1;
        /** ch_enabled45 : R/WTC/WS; bitpos: [13]; default: 0;
         *  Represents channel45 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled45:1;
        /** ch_enabled46 : R/WTC/WS; bitpos: [14]; default: 0;
         *  Represents channel46 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled46:1;
        /** ch_enabled47 : R/WTC/WS; bitpos: [15]; default: 0;
         *  Represents channel47 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled47:1;
        /** ch_enabled48 : R/WTC/WS; bitpos: [16]; default: 0;
         *  Represents channel48 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled48:1;
        /** ch_enabled49 : R/WTC/WS; bitpos: [17]; default: 0;
         *  Represents channel49 enable status.
         *  0: Disable
         *  1: Enable
         */
        uint32_t ch_enabled49:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} soc_etm_ch_ena_ad1_reg_t;

/** Type of evt_st0 register
 *  Event trigger status register
 */
typedef union {
    struct {
        /** gpio_evt_ch0_rise_edge_st : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents GPIO_EVT_CH0_RISE_EDGE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_evt_ch0_rise_edge_st:1;
        /** gpio_evt_ch1_rise_edge_st : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents GPIO_EVT_CH1_RISE_EDGE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_evt_ch1_rise_edge_st:1;
        /** gpio_evt_ch2_rise_edge_st : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents GPIO_EVT_CH2_RISE_EDGE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_evt_ch2_rise_edge_st:1;
        /** gpio_evt_ch3_rise_edge_st : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents GPIO_EVT_CH3_RISE_EDGE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_evt_ch3_rise_edge_st:1;
        /** gpio_evt_ch4_rise_edge_st : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents GPIO_EVT_CH4_RISE_EDGE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_evt_ch4_rise_edge_st:1;
        /** gpio_evt_ch5_rise_edge_st : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents GPIO_EVT_CH5_RISE_EDGE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_evt_ch5_rise_edge_st:1;
        /** gpio_evt_ch6_rise_edge_st : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents GPIO_EVT_CH6_RISE_EDGE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_evt_ch6_rise_edge_st:1;
        /** gpio_evt_ch7_rise_edge_st : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents GPIO_EVT_CH7_RISE_EDGE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_evt_ch7_rise_edge_st:1;
        /** gpio_evt_ch0_fall_edge_st : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents GPIO_EVT_CH0_FALL_EDGE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_evt_ch0_fall_edge_st:1;
        /** gpio_evt_ch1_fall_edge_st : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents GPIO_EVT_CH1_FALL_EDGE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_evt_ch1_fall_edge_st:1;
        /** gpio_evt_ch2_fall_edge_st : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents GPIO_EVT_CH2_FALL_EDGE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_evt_ch2_fall_edge_st:1;
        /** gpio_evt_ch3_fall_edge_st : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents GPIO_EVT_CH3_FALL_EDGE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_evt_ch3_fall_edge_st:1;
        /** gpio_evt_ch4_fall_edge_st : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents GPIO_EVT_CH4_FALL_EDGE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_evt_ch4_fall_edge_st:1;
        /** gpio_evt_ch5_fall_edge_st : R/WTC/SS; bitpos: [13]; default: 0;
         *  Represents GPIO_EVT_CH5_FALL_EDGE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_evt_ch5_fall_edge_st:1;
        /** gpio_evt_ch6_fall_edge_st : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents GPIO_EVT_CH6_FALL_EDGE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_evt_ch6_fall_edge_st:1;
        /** gpio_evt_ch7_fall_edge_st : R/WTC/SS; bitpos: [15]; default: 0;
         *  Represents GPIO_EVT_CH7_FALL_EDGE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_evt_ch7_fall_edge_st:1;
        /** gpio_evt_ch0_any_edge_st : R/WTC/SS; bitpos: [16]; default: 0;
         *  Represents GPIO_EVT_CH0_ANY_EDGE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_evt_ch0_any_edge_st:1;
        /** gpio_evt_ch1_any_edge_st : R/WTC/SS; bitpos: [17]; default: 0;
         *  Represents GPIO_EVT_CH1_ANY_EDGE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_evt_ch1_any_edge_st:1;
        /** gpio_evt_ch2_any_edge_st : R/WTC/SS; bitpos: [18]; default: 0;
         *  Represents GPIO_EVT_CH2_ANY_EDGE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_evt_ch2_any_edge_st:1;
        /** gpio_evt_ch3_any_edge_st : R/WTC/SS; bitpos: [19]; default: 0;
         *  Represents GPIO_EVT_CH3_ANY_EDGE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_evt_ch3_any_edge_st:1;
        /** gpio_evt_ch4_any_edge_st : R/WTC/SS; bitpos: [20]; default: 0;
         *  Represents GPIO_EVT_CH4_ANY_EDGE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_evt_ch4_any_edge_st:1;
        /** gpio_evt_ch5_any_edge_st : R/WTC/SS; bitpos: [21]; default: 0;
         *  Represents GPIO_EVT_CH5_ANY_EDGE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_evt_ch5_any_edge_st:1;
        /** gpio_evt_ch6_any_edge_st : R/WTC/SS; bitpos: [22]; default: 0;
         *  Represents GPIO_EVT_CH6_ANY_EDGE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_evt_ch6_any_edge_st:1;
        /** gpio_evt_ch7_any_edge_st : R/WTC/SS; bitpos: [23]; default: 0;
         *  Represents GPIO_EVT_CH7_ANY_EDGE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_evt_ch7_any_edge_st:1;
        /** gpio_evt_zero_det_pos0_st : R/WTC/SS; bitpos: [24]; default: 0;
         *  Represents GPIO_EVT_ZERO_DET_POS0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_evt_zero_det_pos0_st:1;
        /** gpio_evt_zero_det_neg0_st : R/WTC/SS; bitpos: [25]; default: 0;
         *  Represents GPIO_EVT_ZERO_DET_NEG0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_evt_zero_det_neg0_st:1;
        uint32_t reserved_26:2;
        /** ledc_evt_duty_chng_end_ch0_st : R/WTC/SS; bitpos: [28]; default: 0;
         *  Represents LEDC_EVT_DUTY_CHNG_END_CH0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_evt_duty_chng_end_ch0_st:1;
        /** ledc_evt_duty_chng_end_ch1_st : R/WTC/SS; bitpos: [29]; default: 0;
         *  Represents LEDC_EVT_DUTY_CHNG_END_CH1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_evt_duty_chng_end_ch1_st:1;
        /** ledc_evt_duty_chng_end_ch2_st : R/WTC/SS; bitpos: [30]; default: 0;
         *  Represents LEDC_EVT_DUTY_CHNG_END_CH2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_evt_duty_chng_end_ch2_st:1;
        /** ledc_evt_duty_chng_end_ch3_st : R/WTC/SS; bitpos: [31]; default: 0;
         *  Represents LEDC_EVT_DUTY_CHNG_END_CH3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_evt_duty_chng_end_ch3_st:1;
    };
    uint32_t val;
} soc_etm_evt_st0_reg_t;

