espressif/esp-idf/components/soc/esp32c61/register/soc/soc_etm_struct.h
/** Type of evt_st1 register
 *  Event trigger status register
 */
typedef union {
    struct {
        /** ledc_evt_duty_chng_end_ch4_st : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents LEDC_EVT_DUTY_CHNG_END_CH4 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_evt_duty_chng_end_ch4_st:1;
        /** ledc_evt_duty_chng_end_ch5_st : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents LEDC_EVT_DUTY_CHNG_END_CH5 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_evt_duty_chng_end_ch5_st:1;
        /** ledc_evt_ovf_cnt_pls_ch0_st : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents LEDC_EVT_OVF_CNT_PLS_CH0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_evt_ovf_cnt_pls_ch0_st:1;
        /** ledc_evt_ovf_cnt_pls_ch1_st : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents LEDC_EVT_OVF_CNT_PLS_CH1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_evt_ovf_cnt_pls_ch1_st:1;
        /** ledc_evt_ovf_cnt_pls_ch2_st : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents LEDC_EVT_OVF_CNT_PLS_CH2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_evt_ovf_cnt_pls_ch2_st:1;
        /** ledc_evt_ovf_cnt_pls_ch3_st : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents LEDC_EVT_OVF_CNT_PLS_CH3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_evt_ovf_cnt_pls_ch3_st:1;
        /** ledc_evt_ovf_cnt_pls_ch4_st : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents LEDC_EVT_OVF_CNT_PLS_CH4 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_evt_ovf_cnt_pls_ch4_st:1;
        /** ledc_evt_ovf_cnt_pls_ch5_st : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents LEDC_EVT_OVF_CNT_PLS_CH5 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_evt_ovf_cnt_pls_ch5_st:1;
        /** ledc_evt_time_ovf_timer0_st : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents LEDC_EVT_TIME_OVF_TIMER0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_evt_time_ovf_timer0_st:1;
        /** ledc_evt_time_ovf_timer1_st : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents LEDC_EVT_TIME_OVF_TIMER1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_evt_time_ovf_timer1_st:1;
        /** ledc_evt_time_ovf_timer2_st : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents LEDC_EVT_TIME_OVF_TIMER2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_evt_time_ovf_timer2_st:1;
        /** ledc_evt_time_ovf_timer3_st : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents LEDC_EVT_TIME_OVF_TIMER3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_evt_time_ovf_timer3_st:1;
        /** ledc_evt_timer0_cmp_st : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents LEDC_EVT_TIMER0_CMP trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_evt_timer0_cmp_st:1;
        /** ledc_evt_timer1_cmp_st : R/WTC/SS; bitpos: [13]; default: 0;
         *  Represents LEDC_EVT_TIMER1_CMP trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_evt_timer1_cmp_st:1;
        /** ledc_evt_timer2_cmp_st : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents LEDC_EVT_TIMER2_CMP trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_evt_timer2_cmp_st:1;
        /** ledc_evt_timer3_cmp_st : R/WTC/SS; bitpos: [15]; default: 0;
         *  Represents LEDC_EVT_TIMER3_CMP trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_evt_timer3_cmp_st:1;
        /** tg0_evt_cnt_cmp_timer0_st : R/WTC/SS; bitpos: [16]; default: 0;
         *  Represents TG0_EVT_CNT_CMP_TIMER0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg0_evt_cnt_cmp_timer0_st:1;
        /** tg0_evt_cnt_cmp_timer1_st : R/WTC/SS; bitpos: [17]; default: 0;
         *  Represents TG0_EVT_CNT_CMP_TIMER1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg0_evt_cnt_cmp_timer1_st:1;
        /** tg1_evt_cnt_cmp_timer0_st : R/WTC/SS; bitpos: [18]; default: 0;
         *  Represents TG1_EVT_CNT_CMP_TIMER0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg1_evt_cnt_cmp_timer0_st:1;
        /** tg1_evt_cnt_cmp_timer1_st : R/WTC/SS; bitpos: [19]; default: 0;
         *  Represents TG1_EVT_CNT_CMP_TIMER1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg1_evt_cnt_cmp_timer1_st:1;
        /** systimer_evt_cnt_cmp0_st : R/WTC/SS; bitpos: [20]; default: 0;
         *  Represents SYSTIMER_EVT_CNT_CMP0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t systimer_evt_cnt_cmp0_st:1;
        /** systimer_evt_cnt_cmp1_st : R/WTC/SS; bitpos: [21]; default: 0;
         *  Represents SYSTIMER_EVT_CNT_CMP1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t systimer_evt_cnt_cmp1_st:1;
        /** systimer_evt_cnt_cmp2_st : R/WTC/SS; bitpos: [22]; default: 0;
         *  Represents SYSTIMER_EVT_CNT_CMP2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t systimer_evt_cnt_cmp2_st:1;
        /** adc_evt_conv_cmplt0_st : R/WTC/SS; bitpos: [23]; default: 0;
         *  Represents ADC_EVT_CONV_CMPLT0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t adc_evt_conv_cmplt0_st:1;
        /** adc_evt_eq_above_thresh0_st : R/WTC/SS; bitpos: [24]; default: 0;
         *  Represents ADC_EVT_EQ_ABOVE_THRESH0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t adc_evt_eq_above_thresh0_st:1;
        /** adc_evt_eq_above_thresh1_st : R/WTC/SS; bitpos: [25]; default: 0;
         *  Represents ADC_EVT_EQ_ABOVE_THRESH1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t adc_evt_eq_above_thresh1_st:1;
        /** adc_evt_eq_below_thresh0_st : R/WTC/SS; bitpos: [26]; default: 0;
         *  Represents ADC_EVT_EQ_BELOW_THRESH0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t adc_evt_eq_below_thresh0_st:1;
        /** adc_evt_eq_below_thresh1_st : R/WTC/SS; bitpos: [27]; default: 0;
         *  Represents ADC_EVT_EQ_BELOW_THRESH1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t adc_evt_eq_below_thresh1_st:1;
        /** adc_evt_result_done0_st : R/WTC/SS; bitpos: [28]; default: 0;
         *  Represents ADC_EVT_RESULT_DONE0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t adc_evt_result_done0_st:1;
        /** adc_evt_stopped0_st : R/WTC/SS; bitpos: [29]; default: 0;
         *  Represents ADC_EVT_STOPPED0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t adc_evt_stopped0_st:1;
        /** adc_evt_started0_st : R/WTC/SS; bitpos: [30]; default: 0;
         *  Represents ADC_EVT_STARTED0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t adc_evt_started0_st:1;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} soc_etm_evt_st1_reg_t;

/** Type of evt_st2 register
 *  Event trigger status register
 */
typedef union {
    struct {
        uint32_t reserved_0:7;
        /** tmpsnsr_evt_over_limit_st : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents TMPSNSR_EVT_OVER_LIMIT trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tmpsnsr_evt_over_limit_st:1;
        /** i2s0_evt_rx_done_st : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents I2S0_EVT_RX_DONE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t i2s0_evt_rx_done_st:1;
        /** i2s0_evt_tx_done_st : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents I2S0_EVT_TX_DONE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t i2s0_evt_tx_done_st:1;
        /** i2s0_evt_x_words_received_st : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents I2S0_EVT_X_WORDS_RECEIVED trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t i2s0_evt_x_words_received_st:1;
        /** i2s0_evt_x_words_sent_st : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents I2S0_EVT_X_WORDS_SENT trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t i2s0_evt_x_words_sent_st:1;
        uint32_t reserved_12:7;
        /** rtc_evt_tick_st : R/WTC/SS; bitpos: [19]; default: 0;
         *  Represents RTC_EVT_TICK trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t rtc_evt_tick_st:1;
        /** rtc_evt_ovf_st : R/WTC/SS; bitpos: [20]; default: 0;
         *  Represents RTC_EVT_OVF trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t rtc_evt_ovf_st:1;
        /** rtc_evt_cmp_st : R/WTC/SS; bitpos: [21]; default: 0;
         *  Represents RTC_EVT_CMP trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t rtc_evt_cmp_st:1;
        /** gdma_ahb_evt_in_done_ch0_st : R/WTC/SS; bitpos: [22]; default: 0;
         *  Represents GDMA_AHB_EVT_IN_DONE_CH0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gdma_ahb_evt_in_done_ch0_st:1;
        /** gdma_ahb_evt_in_done_ch1_st : R/WTC/SS; bitpos: [23]; default: 0;
         *  Represents GDMA_AHB_EVT_IN_DONE_CH1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gdma_ahb_evt_in_done_ch1_st:1;
        uint32_t reserved_24:1;
        /** gdma_ahb_evt_in_suc_eof_ch0_st : R/WTC/SS; bitpos: [25]; default: 0;
         *  Represents GDMA_AHB_EVT_IN_SUC_EOF_CH0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gdma_ahb_evt_in_suc_eof_ch0_st:1;
        /** gdma_ahb_evt_in_suc_eof_ch1_st : R/WTC/SS; bitpos: [26]; default: 0;
         *  Represents GDMA_AHB_EVT_IN_SUC_EOF_CH1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gdma_ahb_evt_in_suc_eof_ch1_st:1;
        uint32_t reserved_27:1;
        /** gdma_ahb_evt_in_fifo_empty_ch0_st : R/WTC/SS; bitpos: [28]; default: 0;
         *  Represents GDMA_AHB_EVT_IN_FIFO_EMPTY_CH0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gdma_ahb_evt_in_fifo_empty_ch0_st:1;
        /** gdma_ahb_evt_in_fifo_empty_ch1_st : R/WTC/SS; bitpos: [29]; default: 0;
         *  Represents GDMA_AHB_EVT_IN_FIFO_EMPTY_CH1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gdma_ahb_evt_in_fifo_empty_ch1_st:1;
        uint32_t reserved_30:1;
        /** gdma_ahb_evt_in_fifo_full_ch0_st : R/WTC/SS; bitpos: [31]; default: 0;
         *  Represents GDMA_AHB_EVT_IN_FIFO_FULL_CH0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gdma_ahb_evt_in_fifo_full_ch0_st:1;
    };
    uint32_t val;
} soc_etm_evt_st2_reg_t;

/** Type of evt_st3 register
 *  Event trigger status register
 */
typedef union {
    struct {
        /** gdma_ahb_evt_in_fifo_full_ch1_st : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents GDMA_AHB_EVT_IN_FIFO_FULL_CH1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gdma_ahb_evt_in_fifo_full_ch1_st:1;
        uint32_t reserved_1:1;
        /** gdma_ahb_evt_out_done_ch0_st : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents GDMA_AHB_EVT_OUT_DONE_CH0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gdma_ahb_evt_out_done_ch0_st:1;
        /** gdma_ahb_evt_out_done_ch1_st : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents GDMA_AHB_EVT_OUT_DONE_CH1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gdma_ahb_evt_out_done_ch1_st:1;
        uint32_t reserved_4:1;
        /** gdma_ahb_evt_out_eof_ch0_st : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents GDMA_AHB_EVT_OUT_EOF_CH0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gdma_ahb_evt_out_eof_ch0_st:1;
        /** gdma_ahb_evt_out_eof_ch1_st : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents GDMA_AHB_EVT_OUT_EOF_CH1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gdma_ahb_evt_out_eof_ch1_st:1;
        uint32_t reserved_7:1;
        /** gdma_ahb_evt_out_total_eof_ch0_st : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents GDMA_AHB_EVT_OUT_TOTAL_EOF_CH0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gdma_ahb_evt_out_total_eof_ch0_st:1;
        /** gdma_ahb_evt_out_total_eof_ch1_st : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents GDMA_AHB_EVT_OUT_TOTAL_EOF_CH1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gdma_ahb_evt_out_total_eof_ch1_st:1;
        uint32_t reserved_10:1;
        /** gdma_ahb_evt_out_fifo_empty_ch0_st : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents GDMA_AHB_EVT_OUT_FIFO_EMPTY_CH0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gdma_ahb_evt_out_fifo_empty_ch0_st:1;
        /** gdma_ahb_evt_out_fifo_empty_ch1_st : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents GDMA_AHB_EVT_OUT_FIFO_EMPTY_CH1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gdma_ahb_evt_out_fifo_empty_ch1_st:1;
        uint32_t reserved_13:1;
        /** gdma_ahb_evt_out_fifo_full_ch0_st : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents GDMA_AHB_EVT_OUT_FIFO_FULL_CH0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gdma_ahb_evt_out_fifo_full_ch0_st:1;
        /** gdma_ahb_evt_out_fifo_full_ch1_st : R/WTC/SS; bitpos: [15]; default: 0;
         *  Represents GDMA_AHB_EVT_OUT_FIFO_FULL_CH1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gdma_ahb_evt_out_fifo_full_ch1_st:1;
        uint32_t reserved_16:1;
        /** pmu_evt_sleep_weekup_st : R/WTC/SS; bitpos: [17]; default: 0;
         *  Represents PMU_EVT_SLEEP_WEEKUP trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t pmu_evt_sleep_weekup_st:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} soc_etm_evt_st3_reg_t;

/** Type of task_st0 register
 *  Task trigger status register
 */
typedef union {
    struct {
        /** gpio_task_ch0_set_st : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents GPIO_TASK_CH0_SET trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_task_ch0_set_st:1;
        /** gpio_task_ch1_set_st : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents GPIO_TASK_CH1_SET trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_task_ch1_set_st:1;
        /** gpio_task_ch2_set_st : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents GPIO_TASK_CH2_SET trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_task_ch2_set_st:1;
        /** gpio_task_ch3_set_st : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents GPIO_TASK_CH3_SET trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_task_ch3_set_st:1;
        /** gpio_task_ch4_set_st : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents GPIO_TASK_CH4_SET trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_task_ch4_set_st:1;
        /** gpio_task_ch5_set_st : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents GPIO_TASK_CH5_SET trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_task_ch5_set_st:1;
        /** gpio_task_ch6_set_st : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents GPIO_TASK_CH6_SET trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_task_ch6_set_st:1;
        /** gpio_task_ch7_set_st : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents GPIO_TASK_CH7_SET trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_task_ch7_set_st:1;
        /** gpio_task_ch0_clear_st : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents GPIO_TASK_CH0_CLEAR trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_task_ch0_clear_st:1;
        /** gpio_task_ch1_clear_st : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents GPIO_TASK_CH1_CLEAR trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_task_ch1_clear_st:1;
        /** gpio_task_ch2_clear_st : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents GPIO_TASK_CH2_CLEAR trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_task_ch2_clear_st:1;
        /** gpio_task_ch3_clear_st : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents GPIO_TASK_CH3_CLEAR trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_task_ch3_clear_st:1;
        /** gpio_task_ch4_clear_st : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents GPIO_TASK_CH4_CLEAR trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_task_ch4_clear_st:1;
        /** gpio_task_ch5_clear_st : R/WTC/SS; bitpos: [13]; default: 0;
         *  Represents GPIO_TASK_CH5_CLEAR trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_task_ch5_clear_st:1;
        /** gpio_task_ch6_clear_st : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents GPIO_TASK_CH6_CLEAR trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_task_ch6_clear_st:1;
        /** gpio_task_ch7_clear_st : R/WTC/SS; bitpos: [15]; default: 0;
         *  Represents GPIO_TASK_CH7_CLEAR trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_task_ch7_clear_st:1;
        /** gpio_task_ch0_toggle_st : R/WTC/SS; bitpos: [16]; default: 0;
         *  Represents GPIO_TASK_CH0_TOGGLE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_task_ch0_toggle_st:1;
        /** gpio_task_ch1_toggle_st : R/WTC/SS; bitpos: [17]; default: 0;
         *  Represents GPIO_TASK_CH1_TOGGLE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_task_ch1_toggle_st:1;
        /** gpio_task_ch2_toggle_st : R/WTC/SS; bitpos: [18]; default: 0;
         *  Represents GPIO_TASK_CH2_TOGGLE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_task_ch2_toggle_st:1;
        /** gpio_task_ch3_toggle_st : R/WTC/SS; bitpos: [19]; default: 0;
         *  Represents GPIO_TASK_CH3_TOGGLE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_task_ch3_toggle_st:1;
        /** gpio_task_ch4_toggle_st : R/WTC/SS; bitpos: [20]; default: 0;
         *  Represents GPIO_TASK_CH4_TOGGLE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_task_ch4_toggle_st:1;
        /** gpio_task_ch5_toggle_st : R/WTC/SS; bitpos: [21]; default: 0;
         *  Represents GPIO_TASK_CH5_TOGGLE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_task_ch5_toggle_st:1;
        /** gpio_task_ch6_toggle_st : R/WTC/SS; bitpos: [22]; default: 0;
         *  Represents GPIO_TASK_CH6_TOGGLE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_task_ch6_toggle_st:1;
        /** gpio_task_ch7_toggle_st : R/WTC/SS; bitpos: [23]; default: 0;
         *  Represents GPIO_TASK_CH7_TOGGLE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t gpio_task_ch7_toggle_st:1;
        /** ledc_task_timer0_res_update_st : R/WTC/SS; bitpos: [24]; default: 0;
         *  Represents LEDC_TASK_TIMER0_RES_UPDATE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_timer0_res_update_st:1;
        /** ledc_task_timer1_res_update_st : R/WTC/SS; bitpos: [25]; default: 0;
         *  Represents LEDC_TASK_TIMER1_RES_UPDATE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_timer1_res_update_st:1;
        /** ledc_task_timer2_res_update_st : R/WTC/SS; bitpos: [26]; default: 0;
         *  Represents LEDC_TASK_TIMER2_RES_UPDATE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_timer2_res_update_st:1;
        /** ledc_task_timer3_res_update_st : R/WTC/SS; bitpos: [27]; default: 0;
         *  Represents LEDC_TASK_TIMER3_RES_UPDATE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_timer3_res_update_st:1;
        /** ledc_task_duty_scale_update_ch0_st : R/WTC/SS; bitpos: [28]; default: 0;
         *  Represents LEDC_TASK_DUTY_SCALE_UPDATE_CH0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_duty_scale_update_ch0_st:1;
        /** ledc_task_duty_scale_update_ch1_st : R/WTC/SS; bitpos: [29]; default: 0;
         *  Represents LEDC_TASK_DUTY_SCALE_UPDATE_CH1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_duty_scale_update_ch1_st:1;
        /** ledc_task_duty_scale_update_ch2_st : R/WTC/SS; bitpos: [30]; default: 0;
         *  Represents LEDC_TASK_DUTY_SCALE_UPDATE_CH2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_duty_scale_update_ch2_st:1;
        /** ledc_task_duty_scale_update_ch3_st : R/WTC/SS; bitpos: [31]; default: 0;
         *  Represents LEDC_TASK_DUTY_SCALE_UPDATE_CH3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_duty_scale_update_ch3_st:1;
    };
    uint32_t val;
} soc_etm_task_st0_reg_t;

