espressif/esp-idf/components/soc/esp32c61/register/soc/soc_etm_struct.h
/** Type of task_st1 register
 *  Task trigger status register
 */
typedef union {
    struct {
        /** ledc_task_duty_scale_update_ch4_st : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents LEDC_TASK_DUTY_SCALE_UPDATE_CH4 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_duty_scale_update_ch4_st:1;
        /** ledc_task_duty_scale_update_ch5_st : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents LEDC_TASK_DUTY_SCALE_UPDATE_CH5 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_duty_scale_update_ch5_st:1;
        /** ledc_task_timer0_cap_st : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents LEDC_TASK_TIMER0_CAP trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_timer0_cap_st:1;
        /** ledc_task_timer1_cap_st : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents LEDC_TASK_TIMER1_CAP trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_timer1_cap_st:1;
        /** ledc_task_timer2_cap_st : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents LEDC_TASK_TIMER2_CAP trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_timer2_cap_st:1;
        /** ledc_task_timer3_cap_st : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents LEDC_TASK_TIMER3_CAP trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_timer3_cap_st:1;
        /** ledc_task_sig_out_dis_ch0_st : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents LEDC_TASK_SIG_OUT_DIS_CH0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_sig_out_dis_ch0_st:1;
        /** ledc_task_sig_out_dis_ch1_st : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents LEDC_TASK_SIG_OUT_DIS_CH1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_sig_out_dis_ch1_st:1;
        /** ledc_task_sig_out_dis_ch2_st : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents LEDC_TASK_SIG_OUT_DIS_CH2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_sig_out_dis_ch2_st:1;
        /** ledc_task_sig_out_dis_ch3_st : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents LEDC_TASK_SIG_OUT_DIS_CH3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_sig_out_dis_ch3_st:1;
        /** ledc_task_sig_out_dis_ch4_st : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents LEDC_TASK_SIG_OUT_DIS_CH4 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_sig_out_dis_ch4_st:1;
        /** ledc_task_sig_out_dis_ch5_st : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents LEDC_TASK_SIG_OUT_DIS_CH5 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_sig_out_dis_ch5_st:1;
        /** ledc_task_ovf_cnt_rst_ch0_st : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents LEDC_TASK_OVF_CNT_RST_CH0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_ovf_cnt_rst_ch0_st:1;
        /** ledc_task_ovf_cnt_rst_ch1_st : R/WTC/SS; bitpos: [13]; default: 0;
         *  Represents LEDC_TASK_OVF_CNT_RST_CH1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_ovf_cnt_rst_ch1_st:1;
        /** ledc_task_ovf_cnt_rst_ch2_st : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents LEDC_TASK_OVF_CNT_RST_CH2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_ovf_cnt_rst_ch2_st:1;
        /** ledc_task_ovf_cnt_rst_ch3_st : R/WTC/SS; bitpos: [15]; default: 0;
         *  Represents LEDC_TASK_OVF_CNT_RST_CH3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_ovf_cnt_rst_ch3_st:1;
        /** ledc_task_ovf_cnt_rst_ch4_st : R/WTC/SS; bitpos: [16]; default: 0;
         *  Represents LEDC_TASK_OVF_CNT_RST_CH4 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_ovf_cnt_rst_ch4_st:1;
        /** ledc_task_ovf_cnt_rst_ch5_st : R/WTC/SS; bitpos: [17]; default: 0;
         *  Represents LEDC_TASK_OVF_CNT_RST_CH5 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_ovf_cnt_rst_ch5_st:1;
        /** ledc_task_timer0_rst_st : R/WTC/SS; bitpos: [18]; default: 0;
         *  Represents LEDC_TASK_TIMER0_RST trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_timer0_rst_st:1;
        /** ledc_task_timer1_rst_st : R/WTC/SS; bitpos: [19]; default: 0;
         *  Represents LEDC_TASK_TIMER1_RST trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_timer1_rst_st:1;
        /** ledc_task_timer2_rst_st : R/WTC/SS; bitpos: [20]; default: 0;
         *  Represents LEDC_TASK_TIMER2_RST trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_timer2_rst_st:1;
        /** ledc_task_timer3_rst_st : R/WTC/SS; bitpos: [21]; default: 0;
         *  Represents LEDC_TASK_TIMER3_RST trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_timer3_rst_st:1;
        /** ledc_task_timer0_resume_st : R/WTC/SS; bitpos: [22]; default: 0;
         *  Represents LEDC_TASK_TIMER0_RESUME trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_timer0_resume_st:1;
        /** ledc_task_timer1_resume_st : R/WTC/SS; bitpos: [23]; default: 0;
         *  Represents LEDC_TASK_TIMER1_RESUME trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_timer1_resume_st:1;
        /** ledc_task_timer2_resume_st : R/WTC/SS; bitpos: [24]; default: 0;
         *  Represents LEDC_TASK_TIMER2_RESUME trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_timer2_resume_st:1;
        /** ledc_task_timer3_resume_st : R/WTC/SS; bitpos: [25]; default: 0;
         *  Represents LEDC_TASK_TIMER3_RESUME trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_timer3_resume_st:1;
        /** ledc_task_timer0_pause_st : R/WTC/SS; bitpos: [26]; default: 0;
         *  Represents LEDC_TASK_TIMER0_PAUSE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_timer0_pause_st:1;
        /** ledc_task_timer1_pause_st : R/WTC/SS; bitpos: [27]; default: 0;
         *  Represents LEDC_TASK_TIMER1_PAUSE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_timer1_pause_st:1;
        /** ledc_task_timer2_pause_st : R/WTC/SS; bitpos: [28]; default: 0;
         *  Represents LEDC_TASK_TIMER2_PAUSE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_timer2_pause_st:1;
        /** ledc_task_timer3_pause_st : R/WTC/SS; bitpos: [29]; default: 0;
         *  Represents LEDC_TASK_TIMER3_PAUSE trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_timer3_pause_st:1;
        /** ledc_task_gamma_restart_ch0_st : R/WTC/SS; bitpos: [30]; default: 0;
         *  Represents LEDC_TASK_GAMMA_RESTART_CH0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_gamma_restart_ch0_st:1;
        /** ledc_task_gamma_restart_ch1_st : R/WTC/SS; bitpos: [31]; default: 0;
         *  Represents LEDC_TASK_GAMMA_RESTART_CH1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_gamma_restart_ch1_st:1;
    };
    uint32_t val;
} soc_etm_task_st1_reg_t;

/** Type of task_st2 register
 *  Task trigger status register
 */
typedef union {
    struct {
        /** ledc_task_gamma_restart_ch2_st : R/WTC/SS; bitpos: [0]; default: 0;
         *  Represents LEDC_TASK_GAMMA_RESTART_CH2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_gamma_restart_ch2_st:1;
        /** ledc_task_gamma_restart_ch3_st : R/WTC/SS; bitpos: [1]; default: 0;
         *  Represents LEDC_TASK_GAMMA_RESTART_CH3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_gamma_restart_ch3_st:1;
        /** ledc_task_gamma_restart_ch4_st : R/WTC/SS; bitpos: [2]; default: 0;
         *  Represents LEDC_TASK_GAMMA_RESTART_CH4 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_gamma_restart_ch4_st:1;
        /** ledc_task_gamma_restart_ch5_st : R/WTC/SS; bitpos: [3]; default: 0;
         *  Represents LEDC_TASK_GAMMA_RESTART_CH5 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_gamma_restart_ch5_st:1;
        /** ledc_task_gamma_pause_ch0_st : R/WTC/SS; bitpos: [4]; default: 0;
         *  Represents LEDC_TASK_GAMMA_PAUSE_CH0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_gamma_pause_ch0_st:1;
        /** ledc_task_gamma_pause_ch1_st : R/WTC/SS; bitpos: [5]; default: 0;
         *  Represents LEDC_TASK_GAMMA_PAUSE_CH1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_gamma_pause_ch1_st:1;
        /** ledc_task_gamma_pause_ch2_st : R/WTC/SS; bitpos: [6]; default: 0;
         *  Represents LEDC_TASK_GAMMA_PAUSE_CH2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_gamma_pause_ch2_st:1;
        /** ledc_task_gamma_pause_ch3_st : R/WTC/SS; bitpos: [7]; default: 0;
         *  Represents LEDC_TASK_GAMMA_PAUSE_CH3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_gamma_pause_ch3_st:1;
        /** ledc_task_gamma_pause_ch4_st : R/WTC/SS; bitpos: [8]; default: 0;
         *  Represents LEDC_TASK_GAMMA_PAUSE_CH4 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_gamma_pause_ch4_st:1;
        /** ledc_task_gamma_pause_ch5_st : R/WTC/SS; bitpos: [9]; default: 0;
         *  Represents LEDC_TASK_GAMMA_PAUSE_CH5 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_gamma_pause_ch5_st:1;
        /** ledc_task_gamma_resume_ch0_st : R/WTC/SS; bitpos: [10]; default: 0;
         *  Represents LEDC_TASK_GAMMA_RESUME_CH0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_gamma_resume_ch0_st:1;
        /** ledc_task_gamma_resume_ch1_st : R/WTC/SS; bitpos: [11]; default: 0;
         *  Represents LEDC_TASK_GAMMA_RESUME_CH1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_gamma_resume_ch1_st:1;
        /** ledc_task_gamma_resume_ch2_st : R/WTC/SS; bitpos: [12]; default: 0;
         *  Represents LEDC_TASK_GAMMA_RESUME_CH2 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_gamma_resume_ch2_st:1;
        /** ledc_task_gamma_resume_ch3_st : R/WTC/SS; bitpos: [13]; default: 0;
         *  Represents LEDC_TASK_GAMMA_RESUME_CH3 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_gamma_resume_ch3_st:1;
        /** ledc_task_gamma_resume_ch4_st : R/WTC/SS; bitpos: [14]; default: 0;
         *  Represents LEDC_TASK_GAMMA_RESUME_CH4 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_gamma_resume_ch4_st:1;
        /** ledc_task_gamma_resume_ch5_st : R/WTC/SS; bitpos: [15]; default: 0;
         *  Represents LEDC_TASK_GAMMA_RESUME_CH5 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t ledc_task_gamma_resume_ch5_st:1;
        /** tg0_task_cnt_start_timer0_st : R/WTC/SS; bitpos: [16]; default: 0;
         *  Represents TG0_TASK_CNT_START_TIMER0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg0_task_cnt_start_timer0_st:1;
        /** tg0_task_alarm_start_timer0_st : R/WTC/SS; bitpos: [17]; default: 0;
         *  Represents TG0_TASK_ALARM_START_TIMER0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg0_task_alarm_start_timer0_st:1;
        /** tg0_task_cnt_stop_timer0_st : R/WTC/SS; bitpos: [18]; default: 0;
         *  Represents TG0_TASK_CNT_STOP_TIMER0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg0_task_cnt_stop_timer0_st:1;
        /** tg0_task_cnt_reload_timer0_st : R/WTC/SS; bitpos: [19]; default: 0;
         *  Represents TG0_TASK_CNT_RELOAD_TIMER0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg0_task_cnt_reload_timer0_st:1;
        /** tg0_task_cnt_cap_timer0_st : R/WTC/SS; bitpos: [20]; default: 0;
         *  Represents TG0_TASK_CNT_CAP_TIMER0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg0_task_cnt_cap_timer0_st:1;
        /** tg0_task_cnt_start_timer1_st : R/WTC/SS; bitpos: [21]; default: 0;
         *  Represents TG0_TASK_CNT_START_TIMER1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg0_task_cnt_start_timer1_st:1;
        /** tg0_task_alarm_start_timer1_st : R/WTC/SS; bitpos: [22]; default: 0;
         *  Represents TG0_TASK_ALARM_START_TIMER1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg0_task_alarm_start_timer1_st:1;
        /** tg0_task_cnt_stop_timer1_st : R/WTC/SS; bitpos: [23]; default: 0;
         *  Represents TG0_TASK_CNT_STOP_TIMER1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg0_task_cnt_stop_timer1_st:1;
        /** tg0_task_cnt_reload_timer1_st : R/WTC/SS; bitpos: [24]; default: 0;
         *  Represents TG0_TASK_CNT_RELOAD_TIMER1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg0_task_cnt_reload_timer1_st:1;
        /** tg0_task_cnt_cap_timer1_st : R/WTC/SS; bitpos: [25]; default: 0;
         *  Represents TG0_TASK_CNT_CAP_TIMER1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg0_task_cnt_cap_timer1_st:1;
        /** tg1_task_cnt_start_timer0_st : R/WTC/SS; bitpos: [26]; default: 0;
         *  Represents TG1_TASK_CNT_START_TIMER0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg1_task_cnt_start_timer0_st:1;
        /** tg1_task_alarm_start_timer0_st : R/WTC/SS; bitpos: [27]; default: 0;
         *  Represents TG1_TASK_ALARM_START_TIMER0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg1_task_alarm_start_timer0_st:1;
        /** tg1_task_cnt_stop_timer0_st : R/WTC/SS; bitpos: [28]; default: 0;
         *  Represents TG1_TASK_CNT_STOP_TIMER0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg1_task_cnt_stop_timer0_st:1;
        /** tg1_task_cnt_reload_timer0_st : R/WTC/SS; bitpos: [29]; default: 0;
         *  Represents TG1_TASK_CNT_RELOAD_TIMER0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg1_task_cnt_reload_timer0_st:1;
        /** tg1_task_cnt_cap_timer0_st : R/WTC/SS; bitpos: [30]; default: 0;
         *  Represents TG1_TASK_CNT_CAP_TIMER0 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg1_task_cnt_cap_timer0_st:1;
        /** tg1_task_cnt_start_timer1_st : R/WTC/SS; bitpos: [31]; default: 0;
         *  Represents TG1_TASK_CNT_START_TIMER1 trigger status.
         *  0: Not triggered
         *  1: Triggered
         */
        uint32_t tg1_task_cnt_start_timer1_st:1;
    };
    uint32_t val;
} soc_etm_task_st2_reg_t;

