espressif/esp-idf/components/soc/esp32c61/register/soc/soc_etm_struct.h
/** Type of ch_ena_ad1_clr register
 *  Channel disable register
 */
typedef union {
    struct {
        /** ch_disable32 : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to disable channel32.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable32:1;
        /** ch_disable33 : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to disable channel33.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable33:1;
        /** ch_disable34 : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to disable channel34.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable34:1;
        /** ch_disable35 : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to disable channel35.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable35:1;
        /** ch_disable36 : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to disable channel36.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable36:1;
        /** ch_disable37 : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to disable channel37.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable37:1;
        /** ch_disable38 : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to disable channel38.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable38:1;
        /** ch_disable39 : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to disable channel39.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable39:1;
        /** ch_disable40 : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to disable channel40.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable40:1;
        /** ch_disable41 : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to disable channel41.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable41:1;
        /** ch_disable42 : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to disable channel42.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable42:1;
        /** ch_disable43 : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to disable channel43.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable43:1;
        /** ch_disable44 : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to disable channel44.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable44:1;
        /** ch_disable45 : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to disable channel45.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable45:1;
        /** ch_disable46 : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to disable channel46.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable46:1;
        /** ch_disable47 : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to disable channel47.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable47:1;
        /** ch_disable48 : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to disable channel48.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable48:1;
        /** ch_disable49 : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to disable channel49.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ch_disable49:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} soc_etm_ch_ena_ad1_clr_reg_t;

/** Type of chn_evt_id register
 *  Channeln event ID register
 */
typedef union {
    struct {
        /** chn_evt_id : R/W; bitpos: [6:0]; default: 0;
         *  Configures channeln event ID.
         */
        uint32_t chn_evt_id:7;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} soc_etm_chn_evt_id_reg_t;

/** Type of chn_task_id register
 *  Channeln task ID register
 */
typedef union {
    struct {
        /** chn_task_id : R/W; bitpos: [7:0]; default: 0;
         *  Configures channeln task ID.
         */
        uint32_t chn_task_id:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} soc_etm_chn_task_id_reg_t;

/** Type of evt_st0_clr register
 *  Event trigger status clear register
 */
typedef union {
    struct {
        /** gpio_evt_ch0_rise_edge_st_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear GPIO_EVT_CH0_RISE_EDGE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch0_rise_edge_st_clr:1;
        /** gpio_evt_ch1_rise_edge_st_clr : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear GPIO_EVT_CH1_RISE_EDGE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch1_rise_edge_st_clr:1;
        /** gpio_evt_ch2_rise_edge_st_clr : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear GPIO_EVT_CH2_RISE_EDGE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch2_rise_edge_st_clr:1;
        /** gpio_evt_ch3_rise_edge_st_clr : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear GPIO_EVT_CH3_RISE_EDGE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch3_rise_edge_st_clr:1;
        /** gpio_evt_ch4_rise_edge_st_clr : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear GPIO_EVT_CH4_RISE_EDGE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch4_rise_edge_st_clr:1;
        /** gpio_evt_ch5_rise_edge_st_clr : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear GPIO_EVT_CH5_RISE_EDGE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch5_rise_edge_st_clr:1;
        /** gpio_evt_ch6_rise_edge_st_clr : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear GPIO_EVT_CH6_RISE_EDGE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch6_rise_edge_st_clr:1;
        /** gpio_evt_ch7_rise_edge_st_clr : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear GPIO_EVT_CH7_RISE_EDGE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch7_rise_edge_st_clr:1;
        /** gpio_evt_ch0_fall_edge_st_clr : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear GPIO_EVT_CH0_FALL_EDGE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch0_fall_edge_st_clr:1;
        /** gpio_evt_ch1_fall_edge_st_clr : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear GPIO_EVT_CH1_FALL_EDGE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch1_fall_edge_st_clr:1;
        /** gpio_evt_ch2_fall_edge_st_clr : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to clear GPIO_EVT_CH2_FALL_EDGE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch2_fall_edge_st_clr:1;
        /** gpio_evt_ch3_fall_edge_st_clr : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear GPIO_EVT_CH3_FALL_EDGE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch3_fall_edge_st_clr:1;
        /** gpio_evt_ch4_fall_edge_st_clr : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear GPIO_EVT_CH4_FALL_EDGE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch4_fall_edge_st_clr:1;
        /** gpio_evt_ch5_fall_edge_st_clr : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to clear GPIO_EVT_CH5_FALL_EDGE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch5_fall_edge_st_clr:1;
        /** gpio_evt_ch6_fall_edge_st_clr : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to clear GPIO_EVT_CH6_FALL_EDGE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch6_fall_edge_st_clr:1;
        /** gpio_evt_ch7_fall_edge_st_clr : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to clear GPIO_EVT_CH7_FALL_EDGE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch7_fall_edge_st_clr:1;
        /** gpio_evt_ch0_any_edge_st_clr : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to clear GPIO_EVT_CH0_ANY_EDGE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch0_any_edge_st_clr:1;
        /** gpio_evt_ch1_any_edge_st_clr : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to clear GPIO_EVT_CH1_ANY_EDGE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch1_any_edge_st_clr:1;
        /** gpio_evt_ch2_any_edge_st_clr : WT; bitpos: [18]; default: 0;
         *  Configures whether or not to clear GPIO_EVT_CH2_ANY_EDGE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch2_any_edge_st_clr:1;
        /** gpio_evt_ch3_any_edge_st_clr : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to clear GPIO_EVT_CH3_ANY_EDGE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch3_any_edge_st_clr:1;
        /** gpio_evt_ch4_any_edge_st_clr : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to clear GPIO_EVT_CH4_ANY_EDGE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch4_any_edge_st_clr:1;
        /** gpio_evt_ch5_any_edge_st_clr : WT; bitpos: [21]; default: 0;
         *  Configures whether or not to clear GPIO_EVT_CH5_ANY_EDGE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch5_any_edge_st_clr:1;
        /** gpio_evt_ch6_any_edge_st_clr : WT; bitpos: [22]; default: 0;
         *  Configures whether or not to clear GPIO_EVT_CH6_ANY_EDGE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch6_any_edge_st_clr:1;
        /** gpio_evt_ch7_any_edge_st_clr : WT; bitpos: [23]; default: 0;
         *  Configures whether or not to clear GPIO_EVT_CH7_ANY_EDGE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_evt_ch7_any_edge_st_clr:1;
        /** gpio_evt_zero_det_pos0_st_clr : WT; bitpos: [24]; default: 0;
         *  Configures whether or not to clear GPIO_EVT_ZERO_DET_POS0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_evt_zero_det_pos0_st_clr:1;
        /** gpio_evt_zero_det_neg0_st_clr : WT; bitpos: [25]; default: 0;
         *  Configures whether or not to clear GPIO_EVT_ZERO_DET_NEG0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_evt_zero_det_neg0_st_clr:1;
        uint32_t reserved_26:2;
        /** ledc_evt_duty_chng_end_ch0_st_clr : WT; bitpos: [28]; default: 0;
         *  Configures whether or not to clear LEDC_EVT_DUTY_CHNG_END_CH0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_evt_duty_chng_end_ch0_st_clr:1;
        /** ledc_evt_duty_chng_end_ch1_st_clr : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to clear LEDC_EVT_DUTY_CHNG_END_CH1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_evt_duty_chng_end_ch1_st_clr:1;
        /** ledc_evt_duty_chng_end_ch2_st_clr : WT; bitpos: [30]; default: 0;
         *  Configures whether or not to clear LEDC_EVT_DUTY_CHNG_END_CH2 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_evt_duty_chng_end_ch2_st_clr:1;
        /** ledc_evt_duty_chng_end_ch3_st_clr : WT; bitpos: [31]; default: 0;
         *  Configures whether or not to clear LEDC_EVT_DUTY_CHNG_END_CH3 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_evt_duty_chng_end_ch3_st_clr:1;
    };
    uint32_t val;
} soc_etm_evt_st0_clr_reg_t;

/** Type of evt_st1_clr register
 *  Event trigger status clear register
 */
typedef union {
    struct {
        /** ledc_evt_duty_chng_end_ch4_st_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear LEDC_EVT_DUTY_CHNG_END_CH4 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_evt_duty_chng_end_ch4_st_clr:1;
        /** ledc_evt_duty_chng_end_ch5_st_clr : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear LEDC_EVT_DUTY_CHNG_END_CH5 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_evt_duty_chng_end_ch5_st_clr:1;
        /** ledc_evt_ovf_cnt_pls_ch0_st_clr : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear LEDC_EVT_OVF_CNT_PLS_CH0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_evt_ovf_cnt_pls_ch0_st_clr:1;
        /** ledc_evt_ovf_cnt_pls_ch1_st_clr : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear LEDC_EVT_OVF_CNT_PLS_CH1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_evt_ovf_cnt_pls_ch1_st_clr:1;
        /** ledc_evt_ovf_cnt_pls_ch2_st_clr : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear LEDC_EVT_OVF_CNT_PLS_CH2 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_evt_ovf_cnt_pls_ch2_st_clr:1;
        /** ledc_evt_ovf_cnt_pls_ch3_st_clr : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear LEDC_EVT_OVF_CNT_PLS_CH3 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_evt_ovf_cnt_pls_ch3_st_clr:1;
        /** ledc_evt_ovf_cnt_pls_ch4_st_clr : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear LEDC_EVT_OVF_CNT_PLS_CH4 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_evt_ovf_cnt_pls_ch4_st_clr:1;
        /** ledc_evt_ovf_cnt_pls_ch5_st_clr : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear LEDC_EVT_OVF_CNT_PLS_CH5 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_evt_ovf_cnt_pls_ch5_st_clr:1;
        /** ledc_evt_time_ovf_timer0_st_clr : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear LEDC_EVT_TIME_OVF_TIMER0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_evt_time_ovf_timer0_st_clr:1;
        /** ledc_evt_time_ovf_timer1_st_clr : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear LEDC_EVT_TIME_OVF_TIMER1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_evt_time_ovf_timer1_st_clr:1;
        /** ledc_evt_time_ovf_timer2_st_clr : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to clear LEDC_EVT_TIME_OVF_TIMER2 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_evt_time_ovf_timer2_st_clr:1;
        /** ledc_evt_time_ovf_timer3_st_clr : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear LEDC_EVT_TIME_OVF_TIMER3 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_evt_time_ovf_timer3_st_clr:1;
        /** ledc_evt_timer0_cmp_st_clr : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear LEDC_EVT_TIMER0_CMP trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_evt_timer0_cmp_st_clr:1;
        /** ledc_evt_timer1_cmp_st_clr : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to clear LEDC_EVT_TIMER1_CMP trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_evt_timer1_cmp_st_clr:1;
        /** ledc_evt_timer2_cmp_st_clr : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to clear LEDC_EVT_TIMER2_CMP trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_evt_timer2_cmp_st_clr:1;
        /** ledc_evt_timer3_cmp_st_clr : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to clear LEDC_EVT_TIMER3_CMP trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_evt_timer3_cmp_st_clr:1;
        /** tg0_evt_cnt_cmp_timer0_st_clr : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to clear TG0_EVT_CNT_CMP_TIMER0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t tg0_evt_cnt_cmp_timer0_st_clr:1;
        /** tg0_evt_cnt_cmp_timer1_st_clr : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to clear TG0_EVT_CNT_CMP_TIMER1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t tg0_evt_cnt_cmp_timer1_st_clr:1;
        /** tg1_evt_cnt_cmp_timer0_st_clr : WT; bitpos: [18]; default: 0;
         *  Configures whether or not to clear TG1_EVT_CNT_CMP_TIMER0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t tg1_evt_cnt_cmp_timer0_st_clr:1;
        /** tg1_evt_cnt_cmp_timer1_st_clr : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to clear TG1_EVT_CNT_CMP_TIMER1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t tg1_evt_cnt_cmp_timer1_st_clr:1;
        /** systimer_evt_cnt_cmp0_st_clr : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to clear SYSTIMER_EVT_CNT_CMP0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t systimer_evt_cnt_cmp0_st_clr:1;
        /** systimer_evt_cnt_cmp1_st_clr : WT; bitpos: [21]; default: 0;
         *  Configures whether or not to clear SYSTIMER_EVT_CNT_CMP1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t systimer_evt_cnt_cmp1_st_clr:1;
        /** systimer_evt_cnt_cmp2_st_clr : WT; bitpos: [22]; default: 0;
         *  Configures whether or not to clear SYSTIMER_EVT_CNT_CMP2 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t systimer_evt_cnt_cmp2_st_clr:1;
        /** adc_evt_conv_cmplt0_st_clr : WT; bitpos: [23]; default: 0;
         *  Configures whether or not to clear ADC_EVT_CONV_CMPLT0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t adc_evt_conv_cmplt0_st_clr:1;
        /** adc_evt_eq_above_thresh0_st_clr : WT; bitpos: [24]; default: 0;
         *  Configures whether or not to clear ADC_EVT_EQ_ABOVE_THRESH0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t adc_evt_eq_above_thresh0_st_clr:1;
        /** adc_evt_eq_above_thresh1_st_clr : WT; bitpos: [25]; default: 0;
         *  Configures whether or not to clear ADC_EVT_EQ_ABOVE_THRESH1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t adc_evt_eq_above_thresh1_st_clr:1;
        /** adc_evt_eq_below_thresh0_st_clr : WT; bitpos: [26]; default: 0;
         *  Configures whether or not to clear ADC_EVT_EQ_BELOW_THRESH0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t adc_evt_eq_below_thresh0_st_clr:1;
        /** adc_evt_eq_below_thresh1_st_clr : WT; bitpos: [27]; default: 0;
         *  Configures whether or not to clear ADC_EVT_EQ_BELOW_THRESH1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t adc_evt_eq_below_thresh1_st_clr:1;
        /** adc_evt_result_done0_st_clr : WT; bitpos: [28]; default: 0;
         *  Configures whether or not to clear ADC_EVT_RESULT_DONE0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t adc_evt_result_done0_st_clr:1;
        /** adc_evt_stopped0_st_clr : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to clear ADC_EVT_STOPPED0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t adc_evt_stopped0_st_clr:1;
        /** adc_evt_started0_st_clr : WT; bitpos: [30]; default: 0;
         *  Configures whether or not to clear ADC_EVT_STARTED0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t adc_evt_started0_st_clr:1;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} soc_etm_evt_st1_clr_reg_t;

