espressif/esp-idf/components/soc/esp32c61/register/soc/soc_etm_struct.h
/** Type of evt_st2_clr register
 *  Event trigger status clear register
 */
typedef union {
    struct {
        uint32_t reserved_0:7;
        /** tmpsnsr_evt_over_limit_st_clr : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear TMPSNSR_EVT_OVER_LIMIT trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t tmpsnsr_evt_over_limit_st_clr:1;
        /** i2s0_evt_rx_done_st_clr : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear I2S0_EVT_RX_DONE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t i2s0_evt_rx_done_st_clr:1;
        /** i2s0_evt_tx_done_st_clr : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear I2S0_EVT_TX_DONE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t i2s0_evt_tx_done_st_clr:1;
        /** i2s0_evt_x_words_received_st_clr : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to clear I2S0_EVT_X_WORDS_RECEIVED trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t i2s0_evt_x_words_received_st_clr:1;
        /** i2s0_evt_x_words_sent_st_clr : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear I2S0_EVT_X_WORDS_SENT trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t i2s0_evt_x_words_sent_st_clr:1;
        uint32_t reserved_12:7;
        /** rtc_evt_tick_st_clr : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to clear RTC_EVT_TICK trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t rtc_evt_tick_st_clr:1;
        /** rtc_evt_ovf_st_clr : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to clear RTC_EVT_OVF trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t rtc_evt_ovf_st_clr:1;
        /** rtc_evt_cmp_st_clr : WT; bitpos: [21]; default: 0;
         *  Configures whether or not to clear RTC_EVT_CMP trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t rtc_evt_cmp_st_clr:1;
        /** gdma_ahb_evt_in_done_ch0_st_clr : WT; bitpos: [22]; default: 0;
         *  Configures whether or not to clear GDMA_AHB_EVT_IN_DONE_CH0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gdma_ahb_evt_in_done_ch0_st_clr:1;
        /** gdma_ahb_evt_in_done_ch1_st_clr : WT; bitpos: [23]; default: 0;
         *  Configures whether or not to clear GDMA_AHB_EVT_IN_DONE_CH1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gdma_ahb_evt_in_done_ch1_st_clr:1;
        uint32_t reserved_24:1;
        /** gdma_ahb_evt_in_suc_eof_ch0_st_clr : WT; bitpos: [25]; default: 0;
         *  Configures whether or not to clear GDMA_AHB_EVT_IN_SUC_EOF_CH0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gdma_ahb_evt_in_suc_eof_ch0_st_clr:1;
        /** gdma_ahb_evt_in_suc_eof_ch1_st_clr : WT; bitpos: [26]; default: 0;
         *  Configures whether or not to clear GDMA_AHB_EVT_IN_SUC_EOF_CH1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gdma_ahb_evt_in_suc_eof_ch1_st_clr:1;
        uint32_t reserved_27:1;
        /** gdma_ahb_evt_in_fifo_empty_ch0_st_clr : WT; bitpos: [28]; default: 0;
         *  Configures whether or not to clear GDMA_AHB_EVT_IN_FIFO_EMPTY_CH0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gdma_ahb_evt_in_fifo_empty_ch0_st_clr:1;
        /** gdma_ahb_evt_in_fifo_empty_ch1_st_clr : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to clear GDMA_AHB_EVT_IN_FIFO_EMPTY_CH1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gdma_ahb_evt_in_fifo_empty_ch1_st_clr:1;
        uint32_t reserved_30:1;
        /** gdma_ahb_evt_in_fifo_full_ch0_st_clr : WT; bitpos: [31]; default: 0;
         *  Configures whether or not to clear GDMA_AHB_EVT_IN_FIFO_FULL_CH0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gdma_ahb_evt_in_fifo_full_ch0_st_clr:1;
    };
    uint32_t val;
} soc_etm_evt_st2_clr_reg_t;

/** Type of evt_st3_clr register
 *  Event trigger status clear register
 */
typedef union {
    struct {
        /** gdma_ahb_evt_in_fifo_full_ch1_st_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear GDMA_AHB_EVT_IN_FIFO_FULL_CH1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gdma_ahb_evt_in_fifo_full_ch1_st_clr:1;
        uint32_t reserved_1:1;
        /** gdma_ahb_evt_out_done_ch0_st_clr : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear GDMA_AHB_EVT_OUT_DONE_CH0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gdma_ahb_evt_out_done_ch0_st_clr:1;
        /** gdma_ahb_evt_out_done_ch1_st_clr : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear GDMA_AHB_EVT_OUT_DONE_CH1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gdma_ahb_evt_out_done_ch1_st_clr:1;
        uint32_t reserved_4:1;
        /** gdma_ahb_evt_out_eof_ch0_st_clr : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear GDMA_AHB_EVT_OUT_EOF_CH0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gdma_ahb_evt_out_eof_ch0_st_clr:1;
        /** gdma_ahb_evt_out_eof_ch1_st_clr : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear GDMA_AHB_EVT_OUT_EOF_CH1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gdma_ahb_evt_out_eof_ch1_st_clr:1;
        uint32_t reserved_7:1;
        /** gdma_ahb_evt_out_total_eof_ch0_st_clr : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear GDMA_AHB_EVT_OUT_TOTAL_EOF_CH0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gdma_ahb_evt_out_total_eof_ch0_st_clr:1;
        /** gdma_ahb_evt_out_total_eof_ch1_st_clr : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear GDMA_AHB_EVT_OUT_TOTAL_EOF_CH1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gdma_ahb_evt_out_total_eof_ch1_st_clr:1;
        uint32_t reserved_10:1;
        /** gdma_ahb_evt_out_fifo_empty_ch0_st_clr : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear GDMA_AHB_EVT_OUT_FIFO_EMPTY_CH0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gdma_ahb_evt_out_fifo_empty_ch0_st_clr:1;
        /** gdma_ahb_evt_out_fifo_empty_ch1_st_clr : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear GDMA_AHB_EVT_OUT_FIFO_EMPTY_CH1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gdma_ahb_evt_out_fifo_empty_ch1_st_clr:1;
        uint32_t reserved_13:1;
        /** gdma_ahb_evt_out_fifo_full_ch0_st_clr : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to clear GDMA_AHB_EVT_OUT_FIFO_FULL_CH0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gdma_ahb_evt_out_fifo_full_ch0_st_clr:1;
        /** gdma_ahb_evt_out_fifo_full_ch1_st_clr : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to clear GDMA_AHB_EVT_OUT_FIFO_FULL_CH1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gdma_ahb_evt_out_fifo_full_ch1_st_clr:1;
        uint32_t reserved_16:1;
        /** pmu_evt_sleep_weekup_st_clr : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to clear PMU_EVT_SLEEP_WEEKUP trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t pmu_evt_sleep_weekup_st_clr:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} soc_etm_evt_st3_clr_reg_t;

