espressif/esp-idf/components/soc/esp32c61/register/soc/soc_etm_struct.h
/** Type of task_st0_clr register
 *  Task trigger status clear register
 */
typedef union {
    struct {
        /** gpio_task_ch0_set_st_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear GPIO_TASK_CH0_SET trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch0_set_st_clr:1;
        /** gpio_task_ch1_set_st_clr : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear GPIO_TASK_CH1_SET trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch1_set_st_clr:1;
        /** gpio_task_ch2_set_st_clr : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear GPIO_TASK_CH2_SET trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch2_set_st_clr:1;
        /** gpio_task_ch3_set_st_clr : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear GPIO_TASK_CH3_SET trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch3_set_st_clr:1;
        /** gpio_task_ch4_set_st_clr : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear GPIO_TASK_CH4_SET trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch4_set_st_clr:1;
        /** gpio_task_ch5_set_st_clr : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear GPIO_TASK_CH5_SET trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch5_set_st_clr:1;
        /** gpio_task_ch6_set_st_clr : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear GPIO_TASK_CH6_SET trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch6_set_st_clr:1;
        /** gpio_task_ch7_set_st_clr : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear GPIO_TASK_CH7_SET trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch7_set_st_clr:1;
        /** gpio_task_ch0_clear_st_clr : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear GPIO_TASK_CH0_CLEAR trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch0_clear_st_clr:1;
        /** gpio_task_ch1_clear_st_clr : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear GPIO_TASK_CH1_CLEAR trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch1_clear_st_clr:1;
        /** gpio_task_ch2_clear_st_clr : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to clear GPIO_TASK_CH2_CLEAR trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch2_clear_st_clr:1;
        /** gpio_task_ch3_clear_st_clr : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear GPIO_TASK_CH3_CLEAR trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch3_clear_st_clr:1;
        /** gpio_task_ch4_clear_st_clr : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear GPIO_TASK_CH4_CLEAR trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch4_clear_st_clr:1;
        /** gpio_task_ch5_clear_st_clr : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to clear GPIO_TASK_CH5_CLEAR trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch5_clear_st_clr:1;
        /** gpio_task_ch6_clear_st_clr : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to clear GPIO_TASK_CH6_CLEAR trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch6_clear_st_clr:1;
        /** gpio_task_ch7_clear_st_clr : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to clear GPIO_TASK_CH7_CLEAR trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch7_clear_st_clr:1;
        /** gpio_task_ch0_toggle_st_clr : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to clear GPIO_TASK_CH0_TOGGLE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch0_toggle_st_clr:1;
        /** gpio_task_ch1_toggle_st_clr : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to clear GPIO_TASK_CH1_TOGGLE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch1_toggle_st_clr:1;
        /** gpio_task_ch2_toggle_st_clr : WT; bitpos: [18]; default: 0;
         *  Configures whether or not to clear GPIO_TASK_CH2_TOGGLE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch2_toggle_st_clr:1;
        /** gpio_task_ch3_toggle_st_clr : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to clear GPIO_TASK_CH3_TOGGLE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch3_toggle_st_clr:1;
        /** gpio_task_ch4_toggle_st_clr : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to clear GPIO_TASK_CH4_TOGGLE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch4_toggle_st_clr:1;
        /** gpio_task_ch5_toggle_st_clr : WT; bitpos: [21]; default: 0;
         *  Configures whether or not to clear GPIO_TASK_CH5_TOGGLE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch5_toggle_st_clr:1;
        /** gpio_task_ch6_toggle_st_clr : WT; bitpos: [22]; default: 0;
         *  Configures whether or not to clear GPIO_TASK_CH6_TOGGLE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch6_toggle_st_clr:1;
        /** gpio_task_ch7_toggle_st_clr : WT; bitpos: [23]; default: 0;
         *  Configures whether or not to clear GPIO_TASK_CH7_TOGGLE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gpio_task_ch7_toggle_st_clr:1;
        /** ledc_task_timer0_res_update_st_clr : WT; bitpos: [24]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_TIMER0_RES_UPDATE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_timer0_res_update_st_clr:1;
        /** ledc_task_timer1_res_update_st_clr : WT; bitpos: [25]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_TIMER1_RES_UPDATE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_timer1_res_update_st_clr:1;
        /** ledc_task_timer2_res_update_st_clr : WT; bitpos: [26]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_TIMER2_RES_UPDATE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_timer2_res_update_st_clr:1;
        /** ledc_task_timer3_res_update_st_clr : WT; bitpos: [27]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_TIMER3_RES_UPDATE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_timer3_res_update_st_clr:1;
        /** ledc_task_duty_scale_update_ch0_st_clr : WT; bitpos: [28]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_DUTY_SCALE_UPDATE_CH0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_duty_scale_update_ch0_st_clr:1;
        /** ledc_task_duty_scale_update_ch1_st_clr : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_DUTY_SCALE_UPDATE_CH1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_duty_scale_update_ch1_st_clr:1;
        /** ledc_task_duty_scale_update_ch2_st_clr : WT; bitpos: [30]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_DUTY_SCALE_UPDATE_CH2 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_duty_scale_update_ch2_st_clr:1;
        /** ledc_task_duty_scale_update_ch3_st_clr : WT; bitpos: [31]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_DUTY_SCALE_UPDATE_CH3 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_duty_scale_update_ch3_st_clr:1;
    };
    uint32_t val;
} soc_etm_task_st0_clr_reg_t;

/** Type of task_st1_clr register
 *  Task trigger status clear register
 */
typedef union {
    struct {
        /** ledc_task_duty_scale_update_ch4_st_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_DUTY_SCALE_UPDATE_CH4 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_duty_scale_update_ch4_st_clr:1;
        /** ledc_task_duty_scale_update_ch5_st_clr : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_DUTY_SCALE_UPDATE_CH5 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_duty_scale_update_ch5_st_clr:1;
        /** ledc_task_timer0_cap_st_clr : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_TIMER0_CAP trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_timer0_cap_st_clr:1;
        /** ledc_task_timer1_cap_st_clr : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_TIMER1_CAP trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_timer1_cap_st_clr:1;
        /** ledc_task_timer2_cap_st_clr : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_TIMER2_CAP trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_timer2_cap_st_clr:1;
        /** ledc_task_timer3_cap_st_clr : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_TIMER3_CAP trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_timer3_cap_st_clr:1;
        /** ledc_task_sig_out_dis_ch0_st_clr : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_SIG_OUT_DIS_CH0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_sig_out_dis_ch0_st_clr:1;
        /** ledc_task_sig_out_dis_ch1_st_clr : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_SIG_OUT_DIS_CH1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_sig_out_dis_ch1_st_clr:1;
        /** ledc_task_sig_out_dis_ch2_st_clr : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_SIG_OUT_DIS_CH2 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_sig_out_dis_ch2_st_clr:1;
        /** ledc_task_sig_out_dis_ch3_st_clr : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_SIG_OUT_DIS_CH3 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_sig_out_dis_ch3_st_clr:1;
        /** ledc_task_sig_out_dis_ch4_st_clr : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_SIG_OUT_DIS_CH4 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_sig_out_dis_ch4_st_clr:1;
        /** ledc_task_sig_out_dis_ch5_st_clr : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_SIG_OUT_DIS_CH5 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_sig_out_dis_ch5_st_clr:1;
        /** ledc_task_ovf_cnt_rst_ch0_st_clr : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_OVF_CNT_RST_CH0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_ovf_cnt_rst_ch0_st_clr:1;
        /** ledc_task_ovf_cnt_rst_ch1_st_clr : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_OVF_CNT_RST_CH1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_ovf_cnt_rst_ch1_st_clr:1;
        /** ledc_task_ovf_cnt_rst_ch2_st_clr : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_OVF_CNT_RST_CH2 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_ovf_cnt_rst_ch2_st_clr:1;
        /** ledc_task_ovf_cnt_rst_ch3_st_clr : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_OVF_CNT_RST_CH3 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_ovf_cnt_rst_ch3_st_clr:1;
        /** ledc_task_ovf_cnt_rst_ch4_st_clr : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_OVF_CNT_RST_CH4 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_ovf_cnt_rst_ch4_st_clr:1;
        /** ledc_task_ovf_cnt_rst_ch5_st_clr : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_OVF_CNT_RST_CH5 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_ovf_cnt_rst_ch5_st_clr:1;
        /** ledc_task_timer0_rst_st_clr : WT; bitpos: [18]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_TIMER0_RST trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_timer0_rst_st_clr:1;
        /** ledc_task_timer1_rst_st_clr : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_TIMER1_RST trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_timer1_rst_st_clr:1;
        /** ledc_task_timer2_rst_st_clr : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_TIMER2_RST trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_timer2_rst_st_clr:1;
        /** ledc_task_timer3_rst_st_clr : WT; bitpos: [21]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_TIMER3_RST trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_timer3_rst_st_clr:1;
        /** ledc_task_timer0_resume_st_clr : WT; bitpos: [22]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_TIMER0_RESUME trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_timer0_resume_st_clr:1;
        /** ledc_task_timer1_resume_st_clr : WT; bitpos: [23]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_TIMER1_RESUME trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_timer1_resume_st_clr:1;
        /** ledc_task_timer2_resume_st_clr : WT; bitpos: [24]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_TIMER2_RESUME trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_timer2_resume_st_clr:1;
        /** ledc_task_timer3_resume_st_clr : WT; bitpos: [25]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_TIMER3_RESUME trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_timer3_resume_st_clr:1;
        /** ledc_task_timer0_pause_st_clr : WT; bitpos: [26]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_TIMER0_PAUSE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_timer0_pause_st_clr:1;
        /** ledc_task_timer1_pause_st_clr : WT; bitpos: [27]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_TIMER1_PAUSE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_timer1_pause_st_clr:1;
        /** ledc_task_timer2_pause_st_clr : WT; bitpos: [28]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_TIMER2_PAUSE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_timer2_pause_st_clr:1;
        /** ledc_task_timer3_pause_st_clr : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_TIMER3_PAUSE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_timer3_pause_st_clr:1;
        /** ledc_task_gamma_restart_ch0_st_clr : WT; bitpos: [30]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_GAMMA_RESTART_CH0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_gamma_restart_ch0_st_clr:1;
        /** ledc_task_gamma_restart_ch1_st_clr : WT; bitpos: [31]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_GAMMA_RESTART_CH1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_gamma_restart_ch1_st_clr:1;
    };
    uint32_t val;
} soc_etm_task_st1_clr_reg_t;

