espressif/esp-idf/components/soc/esp32c61/register/soc/soc_etm_struct.h
/** Type of task_st2_clr register
 *  Task trigger status clear register
 */
typedef union {
    struct {
        /** ledc_task_gamma_restart_ch2_st_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_GAMMA_RESTART_CH2 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_gamma_restart_ch2_st_clr:1;
        /** ledc_task_gamma_restart_ch3_st_clr : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_GAMMA_RESTART_CH3 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_gamma_restart_ch3_st_clr:1;
        /** ledc_task_gamma_restart_ch4_st_clr : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_GAMMA_RESTART_CH4 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_gamma_restart_ch4_st_clr:1;
        /** ledc_task_gamma_restart_ch5_st_clr : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_GAMMA_RESTART_CH5 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_gamma_restart_ch5_st_clr:1;
        /** ledc_task_gamma_pause_ch0_st_clr : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_GAMMA_PAUSE_CH0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_gamma_pause_ch0_st_clr:1;
        /** ledc_task_gamma_pause_ch1_st_clr : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_GAMMA_PAUSE_CH1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_gamma_pause_ch1_st_clr:1;
        /** ledc_task_gamma_pause_ch2_st_clr : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_GAMMA_PAUSE_CH2 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_gamma_pause_ch2_st_clr:1;
        /** ledc_task_gamma_pause_ch3_st_clr : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_GAMMA_PAUSE_CH3 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_gamma_pause_ch3_st_clr:1;
        /** ledc_task_gamma_pause_ch4_st_clr : WT; bitpos: [8]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_GAMMA_PAUSE_CH4 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_gamma_pause_ch4_st_clr:1;
        /** ledc_task_gamma_pause_ch5_st_clr : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_GAMMA_PAUSE_CH5 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_gamma_pause_ch5_st_clr:1;
        /** ledc_task_gamma_resume_ch0_st_clr : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_GAMMA_RESUME_CH0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_gamma_resume_ch0_st_clr:1;
        /** ledc_task_gamma_resume_ch1_st_clr : WT; bitpos: [11]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_GAMMA_RESUME_CH1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_gamma_resume_ch1_st_clr:1;
        /** ledc_task_gamma_resume_ch2_st_clr : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_GAMMA_RESUME_CH2 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_gamma_resume_ch2_st_clr:1;
        /** ledc_task_gamma_resume_ch3_st_clr : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_GAMMA_RESUME_CH3 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_gamma_resume_ch3_st_clr:1;
        /** ledc_task_gamma_resume_ch4_st_clr : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_GAMMA_RESUME_CH4 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_gamma_resume_ch4_st_clr:1;
        /** ledc_task_gamma_resume_ch5_st_clr : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to clear LEDC_TASK_GAMMA_RESUME_CH5 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t ledc_task_gamma_resume_ch5_st_clr:1;
        /** tg0_task_cnt_start_timer0_st_clr : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to clear TG0_TASK_CNT_START_TIMER0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t tg0_task_cnt_start_timer0_st_clr:1;
        /** tg0_task_alarm_start_timer0_st_clr : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to clear TG0_TASK_ALARM_START_TIMER0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t tg0_task_alarm_start_timer0_st_clr:1;
        /** tg0_task_cnt_stop_timer0_st_clr : WT; bitpos: [18]; default: 0;
         *  Configures whether or not to clear TG0_TASK_CNT_STOP_TIMER0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t tg0_task_cnt_stop_timer0_st_clr:1;
        /** tg0_task_cnt_reload_timer0_st_clr : WT; bitpos: [19]; default: 0;
         *  Configures whether or not to clear TG0_TASK_CNT_RELOAD_TIMER0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t tg0_task_cnt_reload_timer0_st_clr:1;
        /** tg0_task_cnt_cap_timer0_st_clr : WT; bitpos: [20]; default: 0;
         *  Configures whether or not to clear TG0_TASK_CNT_CAP_TIMER0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t tg0_task_cnt_cap_timer0_st_clr:1;
        /** tg0_task_cnt_start_timer1_st_clr : WT; bitpos: [21]; default: 0;
         *  Configures whether or not to clear TG0_TASK_CNT_START_TIMER1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t tg0_task_cnt_start_timer1_st_clr:1;
        /** tg0_task_alarm_start_timer1_st_clr : WT; bitpos: [22]; default: 0;
         *  Configures whether or not to clear TG0_TASK_ALARM_START_TIMER1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t tg0_task_alarm_start_timer1_st_clr:1;
        /** tg0_task_cnt_stop_timer1_st_clr : WT; bitpos: [23]; default: 0;
         *  Configures whether or not to clear TG0_TASK_CNT_STOP_TIMER1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t tg0_task_cnt_stop_timer1_st_clr:1;
        /** tg0_task_cnt_reload_timer1_st_clr : WT; bitpos: [24]; default: 0;
         *  Configures whether or not to clear TG0_TASK_CNT_RELOAD_TIMER1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t tg0_task_cnt_reload_timer1_st_clr:1;
        /** tg0_task_cnt_cap_timer1_st_clr : WT; bitpos: [25]; default: 0;
         *  Configures whether or not to clear TG0_TASK_CNT_CAP_TIMER1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t tg0_task_cnt_cap_timer1_st_clr:1;
        /** tg1_task_cnt_start_timer0_st_clr : WT; bitpos: [26]; default: 0;
         *  Configures whether or not to clear TG1_TASK_CNT_START_TIMER0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t tg1_task_cnt_start_timer0_st_clr:1;
        /** tg1_task_alarm_start_timer0_st_clr : WT; bitpos: [27]; default: 0;
         *  Configures whether or not to clear TG1_TASK_ALARM_START_TIMER0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t tg1_task_alarm_start_timer0_st_clr:1;
        /** tg1_task_cnt_stop_timer0_st_clr : WT; bitpos: [28]; default: 0;
         *  Configures whether or not to clear TG1_TASK_CNT_STOP_TIMER0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t tg1_task_cnt_stop_timer0_st_clr:1;
        /** tg1_task_cnt_reload_timer0_st_clr : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to clear TG1_TASK_CNT_RELOAD_TIMER0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t tg1_task_cnt_reload_timer0_st_clr:1;
        /** tg1_task_cnt_cap_timer0_st_clr : WT; bitpos: [30]; default: 0;
         *  Configures whether or not to clear TG1_TASK_CNT_CAP_TIMER0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t tg1_task_cnt_cap_timer0_st_clr:1;
        /** tg1_task_cnt_start_timer1_st_clr : WT; bitpos: [31]; default: 0;
         *  Configures whether or not to clear TG1_TASK_CNT_START_TIMER1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t tg1_task_cnt_start_timer1_st_clr:1;
    };
    uint32_t val;
} soc_etm_task_st2_clr_reg_t;

/** Type of task_st3_clr register
 *  Task trigger status clear register
 */
typedef union {
    struct {
        /** tg1_task_alarm_start_timer1_st_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear TG1_TASK_ALARM_START_TIMER1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t tg1_task_alarm_start_timer1_st_clr:1;
        /** tg1_task_cnt_stop_timer1_st_clr : WT; bitpos: [1]; default: 0;
         *  Configures whether or not to clear TG1_TASK_CNT_STOP_TIMER1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t tg1_task_cnt_stop_timer1_st_clr:1;
        /** tg1_task_cnt_reload_timer1_st_clr : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear TG1_TASK_CNT_RELOAD_TIMER1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t tg1_task_cnt_reload_timer1_st_clr:1;
        /** tg1_task_cnt_cap_timer1_st_clr : WT; bitpos: [3]; default: 0;
         *  Configures whether or not to clear TG1_TASK_CNT_CAP_TIMER1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t tg1_task_cnt_cap_timer1_st_clr:1;
        /** adc_task_sample0_st_clr : WT; bitpos: [4]; default: 0;
         *  Configures whether or not to clear ADC_TASK_SAMPLE0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t adc_task_sample0_st_clr:1;
        /** adc_task_sample1_st_clr : WT; bitpos: [5]; default: 0;
         *  Configures whether or not to clear ADC_TASK_SAMPLE1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t adc_task_sample1_st_clr:1;
        /** adc_task_start0_st_clr : WT; bitpos: [6]; default: 0;
         *  Configures whether or not to clear ADC_TASK_START0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t adc_task_start0_st_clr:1;
        /** adc_task_stop0_st_clr : WT; bitpos: [7]; default: 0;
         *  Configures whether or not to clear ADC_TASK_STOP0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t adc_task_stop0_st_clr:1;
        uint32_t reserved_8:4;
        /** tmpsnsr_task_start_sample_st_clr : WT; bitpos: [12]; default: 0;
         *  Configures whether or not to clear TMPSNSR_TASK_START_SAMPLE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t tmpsnsr_task_start_sample_st_clr:1;
        /** tmpsnsr_task_stop_sample_st_clr : WT; bitpos: [13]; default: 0;
         *  Configures whether or not to clear TMPSNSR_TASK_STOP_SAMPLE trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t tmpsnsr_task_stop_sample_st_clr:1;
        /** i2s0_task_start_rx_st_clr : WT; bitpos: [14]; default: 0;
         *  Configures whether or not to clear I2S0_TASK_START_RX trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t i2s0_task_start_rx_st_clr:1;
        /** i2s0_task_start_tx_st_clr : WT; bitpos: [15]; default: 0;
         *  Configures whether or not to clear I2S0_TASK_START_TX trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t i2s0_task_start_tx_st_clr:1;
        /** i2s0_task_stop_rx_st_clr : WT; bitpos: [16]; default: 0;
         *  Configures whether or not to clear I2S0_TASK_STOP_RX trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t i2s0_task_stop_rx_st_clr:1;
        /** i2s0_task_stop_tx_st_clr : WT; bitpos: [17]; default: 0;
         *  Configures whether or not to clear I2S0_TASK_STOP_TX trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t i2s0_task_stop_tx_st_clr:1;
        uint32_t reserved_18:10;
        /** gdma_ahb_task_in_start_ch0_st_clr : WT; bitpos: [28]; default: 0;
         *  Configures whether or not to clear GDMA_AHB_TASK_IN_START_CH0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gdma_ahb_task_in_start_ch0_st_clr:1;
        /** gdma_ahb_task_in_start_ch1_st_clr : WT; bitpos: [29]; default: 0;
         *  Configures whether or not to clear GDMA_AHB_TASK_IN_START_CH1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gdma_ahb_task_in_start_ch1_st_clr:1;
        uint32_t reserved_30:1;
        /** gdma_ahb_task_out_start_ch0_st_clr : WT; bitpos: [31]; default: 0;
         *  Configures whether or not to clear GDMA_AHB_TASK_OUT_START_CH0 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gdma_ahb_task_out_start_ch0_st_clr:1;
    };
    uint32_t val;
} soc_etm_task_st3_clr_reg_t;

/** Type of task_st4_clr register
 *  Task trigger status clear register
 */
typedef union {
    struct {
        /** gdma_ahb_task_out_start_ch1_st_clr : WT; bitpos: [0]; default: 0;
         *  Configures whether or not to clear GDMA_AHB_TASK_OUT_START_CH1 trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t gdma_ahb_task_out_start_ch1_st_clr:1;
        uint32_t reserved_1:1;
        /** pmu_task_sleep_req_st_clr : WT; bitpos: [2]; default: 0;
         *  Configures whether or not to clear PMU_TASK_SLEEP_REQ trigger status.
         *  0: Invalid. No effect
         *  1: Clear
         */
        uint32_t pmu_task_sleep_req_st_clr:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} soc_etm_task_st4_clr_reg_t;

